[
    {
      "id": 0,
      "name": "SAMSUNG GALAXY S24",
      "color":"grey",
      "ROM": 128,
      "price": 990,
      "modeName": "S24",
      "modelNumber": "MHGT3HN/A",
      "size": "17.25cm (6.8) full rectangle / 17.22cm (6.8) rounded corners",
      "camera": "200.0 MP + 50.0 MP + 12.0 MP + 10.0 MP",
      "Description": " Display The  Samsung Galaxy S series typically features a high resolution and vibrant display with the latest AMOLED or Super AMOLED technology  The S24 might have a large screen size with minimal bezels for an immersive viewing experiencePerformance Expect powerful hardware components such as the latest generation of Qualcomm Snapdragon or Samsung Exynos processors coupled with ample RAM to ensure smooth multitasking and gaming performanceCamera System  Samsung often focuses on camera technology so the Galaxy S24 might feature an advanced camera setup with multiple lenses including wide-angle ultra-wide-angle and telephoto lenses. Enhanced low-light performance improved stabilization and high-resolution sensors could be some of the anticipated upgrades.Battery Life: Samsung usually equips its flagship phones with sizable batteries to provide long-lasting battery life. Additionally features like fast charging and possibly wireless charging are expectedSoftware and Features: The Galaxy S24 is likely to run on the latest version of Samsung's custom Android skin with features such as Samsung DeX for desktop-like functionality Samsung Knox for enhanced security and various software optimizations to improve user experience.Connectivity: Anticipate support for 5G connectivity Wi-Fi 6 E Bluetooth 5 x NFC and possibly new connectivity features or standards.Design: Samsung pays attention to design aesthetics so the Galaxy S24 might feature a premium build quality possibly with a glass back and aluminum frame. It may also introduce new color options and design elements.Biometric Security: Expect advanced biometric security features such as an in-display fingerprint sensor and facial recognition for secure and convenient device unlocking.Audio: High-quality stereo speakers support for high-resolution audio formats and possibly advanced audio features like spatial audio could be part of the package.Sustainability Initiatives: With increasing focus on sustainability Samsung might introduce eco-friendly materials and packaging along with initiatives to reduce environmental impact throughout the device's lifecycle.",
      "CustomerRating":"5",
      "ExpertRating":"3"
    
    },
    {
      "id": 1,
      "name": "ONEPLUS 12R",
      "color":"BLUE",
      "ROM": 64,
      "price": 790,
      "modeName": "12R",
      "modelNumber": "MH6N3HN/A",
      "size": "15.49 cm (6.1 inch) Display",
      "camera": "12MP Rear Camera | 7MP Front Camera",
      "Description":"OnePlus devices are known for their strong performance, sleek design, and relatively affordable pricing compared to other flagship smartphones. Here are some aspects you might expect from a Get OnePlus 12R:Mobile OnlineKey Feature :---Design: OnePlus often emphasizes sleek and modern design with premium materials. The OnePlus 12R might feature a glass or metal body with slim bezels and possibly a hole-punch or notch display design.Display:4th Generation LTPO 120 Hz ProXDR DisplayExpect a high-resolution and possibly a high-refresh-rate display, providing smooth visuals and vibrant colors. OnePlus has often opted for AMOLED panels for their devices.Performance: OnePlus devices are known for their powerful performance thanks to top-of-the-line processors (likely from Qualcomm’s Snapdragon series) and ample RAM. The OnePlus 12R would likely continue this trend, offering smooth multitasking and excellent gaming performance.Camera:50MP SONY IMX890 CameraOnePlus has been steadily improving its camera quality with each new release. The OnePlus 12R might feature multiple camera lenses for versatile photography, including wide-angle, ultrawide, and telephoto options. Expect advanced software features for photography and videography.Computational photography that’s incomparableFrom images shot in bright sunshine to night time, ProXDR captures moments of brilliance.Our proprietary HDR photography algorithm captures true-to-life highlights and shadows. Enjoy memories you’ll never forget – with advanced ProXDR, what you see is what you get.Software:All-new Dual Cryo-velocity VC Cooling SysteQualcomm Snapdragon® 8 Gen 2Up to 16GB LPDDR5X RAMOnePlus devices typically run on OxygenOS, which is a clean and customizable version of Android. The OnePlus 12R would likely feature the latest version of OxygenOS, optimized for performance and user experience.Battery:5500 mAh Battery + 100W SUPERVOOCOnePlus devices usually come with a sizable battery and fast charging capabilities. The OnePlus 12R might feature fast wired and possibly wireless charging to quickly top up the battery.Connectivity: Expect support for 5G connectivity, as well as the latest Wi-Fi and Bluetooth standards.Price: OnePlus devices often offer flagship-level features at a more competitive price compared to other brands like Samsung or Apple. The OnePlus 12R would likely be priced competitively considering its specifications and featuresDive into 3D sound Dolby digitalPress play and listen your way on any Spatial Audio-supported earphones – wired or wireless. Enjoy simultaneous audio playback in different orientations for the ultimate 3D soundscape.",
      "CustomerRating":"4.5",
      "ExpertRating":"4"
    },
    {
      "id": 2,
      "name": "ARIASOFACUMBED",
      "color":"BLACK",
      "ROM": 0,
      "price": 200,
      "modeName": "ARIA",
      "modelNumber": "MHDC3HN/A",
      "size": "Width – 240 cm,Depth – 215.5 cm,Height – 93 cm",
      "camera": "NA",
      "Description": "Aria corner sofa/sofa bed has some amazing features! It is available as a Left Facing or a Right Facing unit.It easily seats 3 on the couch; plus the ottoman can seat more, or just put your feet up. Also, when you pull out the under part of the couch, its base raises up to the seat height of the couch, and you have a sofa bed!What a great idea, a comfortable sofa in linen fabric. Now, did I miss anything? Oh yes, the ottoman lid lifts up to provide storage.Material:Solid wood and plywoodInternal cushioning: high resilient foam and fibre wrapLinen Fabric",
      "CustomerRating":"5",
      "ExpertRating":"4.5"
    },
    {
      "id": 3,
      "name": "SMART TV",
      "color":"BLACK",
      "ROM": 12,
      "price": 999,
      "modeName": "SONYB RAVIO",
      "modelNumber": "XRX90L",
      "size": "15.49 cm (6.1 inch) Liquid Retina HD",
      "camera": "12MP + 12MP | 12MP Front Camera",
      "Description": "Bravia (stylized as BRAVIA) is a brand of Sony Visual Products Inc., a wholly owned subsidiary of Sony, and is used for its television products. Its name is a backronym for Best Resolution Audio Visual Integrated Architecture. All Sony high-definition flat-panel LCD televisions in North America have carried the logo for BRAVIA since 2005. BRAVIA replaces the LCD WEGA, which Sony used for their LCD TVs until summer 2005 [2] [3] (early promotional photos of the first BRAVIA TVs still bearing the WEGA moniker).[citation needed] In 2014 (on the part of Sony President and CEO Kasuo Hirai's plans to turn Sony around), BRAVIA was made into a subsidiary rather than simply a brand of products.BRAVIA televisions and their components are manufactured in Sony's plants in Mexico, Japan, and Slovakia for their respective regions and are assembled from imported parts in Brazil, Spain, China, Malaysia, and Ecuador. Principal design work for BRAVIA products is performed at Sony's research facilities in Japan, in the research and development department at the Sony de Mexico facility in Baja California, Mexico, and at the Sony Europe facility in Nitra, Slovakia. ",
      "CustomerRating":"4.5",
      "ExpertRating":"3.5"
    },
    {
      "id": 4,
      "name": "CAMERA",
      "color":"BLACK",
      "ROM": 64,
      "price": 720,
      "modeName": "SONY FX6",
      "modelNumber": "FX6",
      "size": "",
      "camera": "12MP + 12MP | 12MP Front Camera",
      "Description": "art of the Sony Cinema Line, the FX6 packs in a 10.2MP full-frame back-illuminated CMOS Exmor R sensor and Bionz XR image processor to create stunning 4K images up to 120p at 10-bit 4:2:2 color depth. Not only does it allow you to record using S-Log3 for more versatility when it comes to color grading, but it's also equipped with S-Cinetone, Sony's latest picture profile that's been developed based on the look of VENICE color science. The benefit of S-Cinetone is that you get a filmic looking image straight from camera. The FX6 also has several filmmaker-friendly features like built-in ND filters, XLR audio, a modular design that allows you to mount it on a gimbal or shoulder mount, and Sony's Hybrid AF, which combines phase detection AF and contrast detection AF for fast and precise autofocus. When it comes to breaking down the technology behind Sony cameras, few people do it better than Alister Chapman. He seemingly knows just about everything inside and out and runs the website XD-Cam, where you can find in-depth discussions about Sony gear and pick up some tips and cool LUTs along the way.  ",
      "CustomerRating":"3.5",
      "ExpertRating":"4.3"
      
    },
    {
      "id": 5,
      "name": "MACBOOK PRO 15",
      "color":"grey",
      "ROM": 128,
      "price": 9900,
      "modeName": "15 PRO",
      "modelNumber": "MHDC3HN/A",
      "size": "15.49 cm (6.1 inch) Liquid Retina HD",
      "camera": "12MP + 12MP | 12MP Front Camera",
      "Description": "Retina display15.4-inch (diagonal) LED-backlit display with IPS technology; 2880-by-1800 native resolution at 220 pixels per inch with support for millions of colorsSupported scaled resolutions:1920 by 12001680 by 10501280 by 8001024 by 640500 nits brightnessWide color (P3)True Tone technologyProcessor2.2GHz2.2GHz 6-core Intel Core i7, Turbo Boost up to 4.1GHz, with 9MB shared L3 cacheConfigurable to 2.9GHz 6-core Intel Core i9, Turbo Boost up to 4.8GHz, with 12MB shared L3 cache2.6GHz2.6GHz 6-core Intel Core i7, Turbo Boost up to 4.3GHz, with 9MB shared L3 cacheConfigurable to 2.9GHz 6-core Intel Core i9, Turbo Boost up to 4.8GHz, with 12MB shared L3 cacheStorage1256GB256GB SSDConfigurable to 512GB, 1TB, 2TB, or 4TB SSD512GB512GB SSDConfigurable to 1TB, 2TB, or 4TB SSDMemory16GB of 2400MHz DDR4 onboard memoryConfigurable to 32GB of memoryGraphics2.2GHzRadeon Pro 555X with 4GB of GDDR5 memory and automatic graphics switchingIntel UHD Graphics 630Configurable to Radeon Pro 560X with 4GB of GDDR5 memory2.6GHzRadeon Pro 560X with 4GB of GDDR5 memory and automatic graphics switchingIntel UHD Graphics 630Configurable to Radeon Pro Vega 16 with 4GB of HBM2 memory or Radeon Pro Vega 20 with 4GB of HBM2 memoryCharging and ExpansionFour Thunderbolt 3 (USB-C) ports with support for:ChargingDisplayPortThunderbolt (up to 40 Gbps)USB 3.1 Gen 2 (up to 10 Gbps)Keyboard and TrackpadFull-size backlit keyboard with:64 (U.S.) or 65 (ISO) keys including 4 arrow keysTouch Bar with integrated Touch ID sensorAmbient light sensorForce Touch trackpad for precise cursor control and pressure-sensing capabilities; enables Force clicks, accelerators, pressure-sensitive drawing, and Multi-Touch gesturesWirelessWi-Fi",
      "CustomerRating":"5",
      "ExpertRating":"3"
    },
    {
      "id": 6,
      "name": "EAR BUDS",
      "color":"BLACK",
      "ROM": 0,
      "price": 780,
      "modeName": "BUDS 3",
      "modelNumber": "MHGT3HN/A",
      "size": "11.94 cm ",
      "camera": "NA",
      "Description": "OnePlus Buds 3. Comes with Dual Dynamic Drivers, Up to 49dB Active Noise Cancelation, Breathtaking Hi-Res Audio with LHDC 5.0, Personalized Audio Experience. Provide IP55 Water and Dust Resistance and Up to 44 Hours Playback.",
      "CustomerRating":"4.5",
      "ExpertRating":"3.5"
    },
    {
      "id": 7,
      "name": "APPLE VISION PRO",
      "color":"GREY",
      "ROM": 64,
      "price": 3500,
      "modeName": "VISION PRO",
      "modelNumber": "MHGT3HN/A",
      "size": "11.94 cm (4.7 inch) Retina HD Display",
      "camera": "12 CAMERAS 6.5 EACH",
      "Description": "Mixed Reality Concept: While it’s technically a VR headset from a hardware perspective, Apple prefers to call it a “spatial computing” device. This term combines elements of both virtual reality (VR) and augmented reality (AR). Unlike traditional VR, which replaces your direct vision with a virtual environment, the Vision Pro overlays digital images onto your actual surroundings, creating a mixed reality experience1.Ultra-High-Resolution Displays: The Vision Pro boasts ultra-high-resolution displays, providing crisp visuals for your augmented experiences2.3D Capture Technology: Equipped with a 3D camera, the headset captures data from your real surroundings and processes it into a 3D map (referred to as spatial mapping). This technology allows the Vision Pro to layer virtual objects onto your physical reality, blurring the line between VR and AR. Hence, the term “mixed reality” comes into play3.Eye Tracking: The Vision Pro also features eye tracking, enhancing interaction and responsiveness within the mixed reality environment.",
      "CustomerRating":"4.5",
      "ExpertRating":"3.5"
    }
]